Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [11]:
import pandas as pd

In [3]:
pd.Series([4,18,15,16,23,42])

0     4
1    18
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
list_1=[1,2,3,4,5,6,7,8,9,10]
ser=pd.Series(list_1)

In [12]:
ser

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [14]:
data={"Name":["Alice","Bob","Claire"],
               "Age":[25,30,27],
                "Gender":["Female","male","Female"]}
df=pd.DataFrame(data)

In [15]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

a DataFrame is a two-dimensional labeled data structure that is commonly used to represent tabular data. It can be thought of as a spreadsheet or SQL table, with rows and columns, where each column can have a different data type (e.g., integers, floats, strings, etc.)

In [21]:
data={"name":["alice","bob","claire"],
     "age":[45,23,64],
     "gender":["male","female","male"]}
df1=pd.DataFrame(data)
df1

     name  age  gender
0   alice   45    male
1     bob   23  female
2  claire   64    male

a Series is a one-dimensional labeled data structure that can be used to represent a column or row of data in a DataFrame. It is similar to a Python list or NumPy array, but with additional labeling capabilities.

In [20]:
year=[2000,2019,2020,2022]
pd.Series(year)

0    2000
1    2019
2    2020
3    2022
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head(n) and tail(n): These functions allow you to view the first or last n rows of the DataFrame.

shape: This function returns the dimensions of the DataFrame in a tuple of (number of rows, number of columns).

describe(): This function provides summary statistics for each column in the DataFrame, including the count, mean, standard deviation, minimum, and maximum values.

drop(columns=[column_name]): This function drops one or more columns from the DataFrame.

rename(columns={"old_name": "new_name"}): This function allows you to rename one or more columns in the DataFrame.

sort_values(by=[column_name]): This function sorts the DataFrame by the values in a specified column.

groupby(by=[column_name]): This function groups the DataFrame by the values in a specified column and returns a GroupBy object.

pivot_table(values=[value_column], index=[index_column], columns=[column_name], aggfunc=[function]): This function creates a pivot table based on the specified values, index, columns, and aggregation function.

fillna(value): This function replaces missing values in the DataFrame with the specified value.

apply(function): This function applies a specified function to each element in the DataFrame.

In [25]:
df1

     name  age  gender
0   alice   45    male
1     bob   23  female
2  claire   64    male

In [26]:
df1.head(2)

    name  age  gender
0  alice   45    male
1    bob   23  female

In [27]:
df1.tail(1)

     name  age gender
2  claire   64   male

In [29]:
df1.shape

(3, 3)

In [30]:
df1.describe()

             age
count   3.000000
mean   44.000000
std    20.518285
min    23.000000
25%    34.000000
50%    45.000000
75%    54.500000
max    64.000000

In [33]:
df1.sort_values(by=["gender"],ascending=False)

     name  age  gender
0   alice   45    male
2  claire   64    male
1     bob   23  female

In [38]:
import numpy as np

In [53]:
df1["age"].sum()

132

Q6.Which of the following is mutable in nature Series, DataFrame, Panel?

 both Series and DataFrame are mutable, which means that you can modify their values, add or remove columns or rows, and perform other operations that change their contents.

Q7.Create a DataFrame using multiple Series. Explain with an example.

In [60]:
data1=pd.Series(["bob","jonh","alice"])
data2=pd.Series([36,45,56])
df=pd.DataFrame({"name":data1,"age":data2})
df

    name  age
0    bob   36
1   jonh   45
2  alice   56

To create a DataFrame using multiple Series, we can use the pd.DataFrame() function in Pandas. This function takes a dictionary of Series objects as input, where each key in the dictionary represents the name of a column in the DataFrame and each value represents the data for that column.